---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTableIterator.MoveNext
source: html/368f06dd-cf29-6edb-6540-995ea157f4be.htm
---
# Autodesk.Revit.DB.ExportLinetypeTableIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.